
//"R%1C%2" : R - Строки, С - Столбцы

//TODO: 

#Область ОбработчикиФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЛеваяГраница = 1;
	ВерхняяГраница = 1;
	КолВоКлетокПоГоризонтали = 100;
	КолВоКлетокПоВертикали = 50;
	
	ЗагрузитьКарту();
КонецПроцедуры

#КонецОбласти

#Область ОбработкаЭлементовМеню

&НаКлиенте
Процедура РежимРисования(Команда)
	РежимРисования = Не РежимРисования;
	Элементы.РежимРисования.Пометка = РежимРисования;
КонецПроцедуры 

&НаКлиенте
Процедура КартаПриАктивизации(Элемент)
	Если ВышлиЗаРамкиКарты(Карта.ТекущаяОбласть) Тогда
		Возврат;
	КонецЕсли;
	
	Если РежимРисования Тогда 
		Карта.ТекущаяОбласть.ЦветФона = ?(Карта.ТекущаяОбласть.ЦветФона = WebЦвета.Черный, ЦветФонаАвто, WebЦвета.Черный);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СледующийШаг(Команда)
	РежимРисования = Ложь;
	Элементы.РежимРисования.Пометка = Ложь;
	РассчитатьСледШаг();
КонецПроцедуры

&НаКлиенте
Процедура Очистить(Команда)
	ЗагрузитьКарту();
КонецПроцедуры

&НаКлиенте
Процедура ПерерисоватьКарту(Команда)
	ЗагрузитьКарту();
КонецПроцедуры


#КонецОбласти

#Область ЛогикаИгры

&НаСервере
Процедура ЗагрузитьКарту()
	Карта.Очистить();
	
	//Обработка = РеквизитФормыВЗначение("Объект");
	//ОбластьКарта = Обработка.ПолучитьМакет("Макет").ПолучитьОбласть("Карта");
	//Карта.Вывести(ОбластьКарта); 
	
	Линия = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная,2);
	
	ИгроваяЗона = Карта.Область(СтрШаблон("R%1C%2:R%3C%4",ВерхняяГраница, ЛеваяГраница, ВерхняяГраница + КолВоКлетокПоВертикали - 1, ЛеваяГраница + КолВоКлетокПоГоризонтали - 1));
	ИгроваяЗона.ШиринаКолонки = 1;
	ИгроваяЗона.ВысотаСтроки = 4.5;
	ИгроваяЗона.Обвести(Линия, Линия, Линия, Линия);
	
	ЦветФонаАвто = Карта.Область("R1C1").ЦветФона;
	ПредварительныйРасчет = Истина;
КонецПроцедуры

&НаСервере
Процедура РассчитатьСледШаг()
	Для ИтерХ = ЛеваяГраница По ЛеваяГраница + КолВоКлетокПоГоризонтали - 1 Цикл
		Для ИтерУ = ВерхняяГраница По ВерхняяГраница +КолВоКлетокПоВертикали - 1 Цикл 
			ТекКлекта = Карта.Область(СтрШаблон("R%1C%2",ИтерУ, ИтерХ));
			ЦветФонаКлетки = ТекКлекта.ЦветФона;
			
			Если ПредварительныйРасчет Тогда
				КолВоСоседей = ПосчитатьСоседейДляКлетки(ТекКлекта);
				Если ЦветФонаКлетки = WebЦвета.Черный И (КолВоСоседей < 2 Или КолВоСоседей > 3) Тогда
					ТекКлекта.ЦветФона = WebЦвета.Красный;
				ИначеЕсли ЦветФонаКлетки = ЦветФонаАвто И (КолВоСоседей = 3) Тогда
					ТекКлекта.ЦветФона = WebЦвета.Зеленый;
				КонецЕсли;
				
			Иначе
				Если ЦветФонаКлетки = WebЦвета.Черный или ЦветФонаКлетки = ЦветФонаАвто Тогда 
					Продолжить;
				ИначеЕсли ЦветФонаКлетки = WebЦвета.Красный Тогда
					ТекКлекта.ЦветФона = ЦветФонаАвто;
				ИначеЕсли ЦветФонаКлетки = WebЦвета.Зеленый Тогда 
					ТекКлекта.ЦветФона = WebЦвета.Черный;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	ПредварительныйРасчет = Не ПредварительныйРасчет;
КонецПроцедуры 

&НаСервере
Функция ПосчитатьСоседейДляКлетки(ТекКлетка)
	КолВоСоседей = 0;
	Верх = ТекКлетка.Верх;
	Лево = ТекКлетка.Лево;
	Низ = ТекКлетка.Низ;
	Право = ТекКлетка.Право;
	
	//Верх
	ПроверитьКлетку(Верх - 1, Лево, КолВоСоседей);
	
	//ВерхЛево
	ПроверитьКлетку(Верх - 1, Лево - 1, КолВоСоседей);
	
	//ВерхПраво
	ПроверитьКлетку(Верх - 1, Право + 1, КолВоСоседей);
	
	//Лево
	ПроверитьКлетку(Верх, Лево - 1, КолВоСоседей);
	
	//Право
	ПроверитьКлетку(Верх, Право + 1, КолВоСоседей);
	
	//Низ
	ПроверитьКлетку(Низ + 1, Лево, КолВоСоседей);
	
	//НизЛево
	ПроверитьКлетку(Низ + 1, Лево - 1, КолВоСоседей);
	
	//НизПраво
	ПроверитьКлетку(Низ + 1, Право + 1, КолВоСоседей);
	
	Возврат КолВоСоседей;
КонецФункции 

&НаСервере
Процедура ПроверитьКлетку(У, Х, КолВоСоседей)
	Верх = ЧсВерх(У);
	Лево = ЧсПрав(Х);
	
	ЦветФона = Карта.Область(СтрШаблон("R%1C%2", Верх, Лево)).ЦветФона;
	Если ЦветФона = WebЦвета.Черный или ЦветФона = WebЦвета.Красный Тогда 
		КолВоСоседей = КолВоСоседей + 1;
	КонецЕсли;

КонецПроцедуры

//Закольцовываем карту по горизонтали
&НаСервере
Функция ЧсПрав(Число)
	Если Число < ЛеваяГраница Тогда 
		Возврат ЛеваяГраница + КолВоКлетокПоГоризонтали - 1;
	ИначеЕсли Число > ЛеваяГраница +КолВоКлетокПоГоризонтали - 1  Тогда
		Возврат ЛеваяГраница;
	КонецЕсли;
	
	Возврат Число;
КонецФункции

//Закольцовываем карту по вертикали
&НаСервере
Функция ЧсВерх(Число)
	Если Число < ВерхняяГраница Тогда 
		Возврат ВерхняяГраница + КолВоКлетокПоВертикали - 1;
	ИначеЕсли Число > ВерхняяГраница + КолВоКлетокПоВертикали- 1 Тогда
		Возврат ВерхняяГраница;
	КонецЕсли;
	
	Возврат Число;
КонецФункции


&НаКлиенте
Функция ВышлиЗаРамкиКарты(ТекКлетка)
	Если ТекКлетка.Лево < ЛеваяГраница 
		Или ТекКлетка.Верх < ВерхняяГраница 
		Или ТекКлетка.Право > ЛеваяГраница + КолВоКлетокПоГоризонтали - 1
		Или ТекКлетка.Низ > ВерхняяГраница + КолВоКлетокПоВертикали - 1
		Тогда
		
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
КонецФункции


#КонецОбласти
