
//"R%1C%2" : R - Строки, С - Столбцы

//TODO: 
&НаКлиенте
Перем КартаИгры; //0 - белый 1 - черный 2 - красный 3 - зеленый

#Область ОбработчикиФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЛеваяГраница = 1;
	ВерхняяГраница = 1;
	КолВоКлетокПоГоризонтали = 100;
	КолВоКлетокПоВертикали = 50;
	
	ЗагрузитьКарту();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОчиститьКартуИгры();	
КонецПроцедуры

&НаКлиенте
Процедура ЗапускИгрыПоТаймеру() Экспорт 
	СледующийШаг(Неопределено);
КонецПроцедуры

#КонецОбласти

#Область ОбработкаЭлементовМеню

&НаКлиенте
Процедура РежимРисования(Команда)
	ОстановитьИгру();
	РежимРисования = Не РежимРисования;
	Элементы.РежимРисования.Пометка = РежимРисования;
КонецПроцедуры 

&НаКлиенте
Процедура КартаПриАктивизации(Элемент)
	Если ВышлиЗаРамкиКарты(Карта.ТекущаяОбласть) Тогда
		Возврат;
	КонецЕсли;
	
	Если РежимРисования Тогда 
		Карта.ТекущаяОбласть.ЦветФона = ?(Карта.ТекущаяОбласть.ЦветФона = WebЦвета.Черный, ЦветФонаАвто, WebЦвета.Черный);
		КартаИгры[Карта.ТекущаяОбласть.Низ-1][Карта.ТекущаяОбласть.Лево-1] = ?(КартаИгры[Карта.ТекущаяОбласть.Низ-1][Карта.ТекущаяОбласть.Лево-1] = 0, 1 , 0);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СледующийШаг(Команда)
	
	Если ИдетРасчет Тогда 
		Возврат;
	КонецЕсли;        
	
	ИдетРасчет = Истина;
	
	РежимРисования = Ложь;
	Элементы.РежимРисования.Пометка = Ложь;
	РассчитатьСледШаг(КартаИгры); 
	Если Не ПредварительныйРасчет И ПропускатьПредварительныйРасчет Тогда 
		РассчитатьСледШаг(КартаИгры);
	КонецЕсли;
	
	ИдетРасчет = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура Очистить(Команда)
	ОстановитьИгру();
	ОчиститьКартуИгры();
	ЗагрузитьКарту();
КонецПроцедуры

&НаКлиенте
Процедура ПерерисоватьКарту(Команда)
	ОстановитьИгру();
	ОчиститьКартуИгры();
	ЗагрузитьКарту();
КонецПроцедуры

&НаКлиенте
Процедура Старт(Команда)
	Если Элементы.Старт.Пометка Тогда 
		ОтключитьОбработчикОжидания("ЗапускИгрыПоТаймеру");
		Элементы.Старт.Заголовок = "Старт";
	Иначе
		ПодключитьОбработчикОжидания("ЗапускИгрыПоТаймеру", 1);
		Элементы.Старт.Заголовок = "Стоп";
	КонецЕсли;                                                 
	
	Элементы.Старт.Пометка = Не Элементы.Старт.Пометка;
КонецПроцедуры

&НаКлиенте
Процедура ОстановитьИгру()
	Если Элементы.Старт.Пометка Тогда 
		ОтключитьОбработчикОжидания("ЗапускИгрыПоТаймеру");
		Элементы.Старт.Заголовок = "Старт";
		Элементы.Старт.Пометка = Не Элементы.Старт.Пометка;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ЛогикаИгры

&НаСервере
Процедура ЗагрузитьКарту()
	Карта.Очистить();
	
	Линия = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная,2);
	
	ИгроваяЗона = Карта.Область(СтрШаблон("R%1C%2:R%3C%4",ВерхняяГраница, ЛеваяГраница, ВерхняяГраница + КолВоКлетокПоВертикали - 1, ЛеваяГраница + КолВоКлетокПоГоризонтали - 1));
	ИгроваяЗона.ШиринаКолонки = 1;
	ИгроваяЗона.ВысотаСтроки = 4.5;
	ИгроваяЗона.Обвести(Линия, Линия, Линия, Линия);
	
	ЦветФонаАвто = Карта.Область("R1C1").ЦветФона;
	ПредварительныйРасчет = Истина;
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСледШаг(КартаИгры)
	Для ИтерХ = 0 По КолВоКлетокПоГоризонтали - 1 Цикл
		Для ИтерУ = 0 По КолВоКлетокПоВертикали - 1 Цикл 	
			Если ПредварительныйРасчет Тогда
				КолВоСоседей = ПосчитатьСоседейДляКлетки(ИтерУ, ИтерХ, КартаИгры);
				Если КартаИгры[ИтерУ][ИтерХ] = 1 И (КолВоСоседей < 2 Или КолВоСоседей > 3) Тогда
					КартаИгры[ИтерУ][ИтерХ] = 2;
				ИначеЕсли КартаИгры[ИтерУ][ИтерХ] = 0 И (КолВоСоседей = 3) Тогда
					КартаИгры[ИтерУ][ИтерХ] = 3;
				КонецЕсли;
				
			Иначе
				Если КартаИгры[ИтерУ][ИтерХ] = 1 или КартаИгры[ИтерУ][ИтерХ] = 0 Тогда 
					Продолжить;
				ИначеЕсли КартаИгры[ИтерУ][ИтерХ] = 2 Тогда
					КартаИгры[ИтерУ][ИтерХ] = 0;
				ИначеЕсли КартаИгры[ИтерУ][ИтерХ] = 3 Тогда 
					КартаИгры[ИтерУ][ИтерХ] = 1;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;

	
	ПредварительныйРасчет = Не ПредварительныйРасчет;
	ПерерисоватьКартуНаСервере(КартаИгры);
КонецПроцедуры 

&НаКлиенте
Процедура ПерерисоватьКартуНаСервере(КартаИгры)
	Если Не ПредварительныйРасчет И ПропускатьПредварительныйРасчет Тогда 
		Возврат;
	КонецЕсли;
	
	Для Строка = 0 По КартаИгры.ВГраница() Цикл
		Для Столбец = 0 По КартаИгры[Строка].ВГраница() Цикл
			Если КартаИгры[Строка][Столбец] = 0 Тогда 
				Карта.Область(Строка+1, Столбец+1, Строка+1, Столбец+1).ЦветФона = ЦветФонаАвто;
			ИначеЕсли КартаИгры[Строка][Столбец] = 1 Тогда
				Карта.Область(Строка+1, Столбец+1, Строка+1, Столбец+1).ЦветФона = WebЦвета.Черный;
			ИначеЕсли КартаИгры[Строка][Столбец] = 2 Тогда
				Карта.Область(Строка+1, Столбец+1, Строка+1, Столбец+1).ЦветФона = WebЦвета.Красный;
			ИначеЕсли КартаИгры[Строка][Столбец] = 3 Тогда
				Карта.Область(Строка+1, Столбец+1, Строка+1, Столбец+1).ЦветФона = WebЦвета.Зеленый;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Функция ПосчитатьСоседейДляКлетки(Столбец, Строка, КартаИгры)
	КолВоСоседей = 0;
	
	//Верх
	ПроверитьКлетку(Столбец - 1, Строка, КолВоСоседей, КартаИгры);
	
	//ВерхЛево
	ПроверитьКлетку(Столбец - 1, Строка - 1, КолВоСоседей, КартаИгры);
	
	//ВерхПраво
	ПроверитьКлетку(Столбец - 1, Строка + 1, КолВоСоседей, КартаИгры);
	
	//Лево
	ПроверитьКлетку(Столбец, Строка - 1, КолВоСоседей, КартаИгры);
	
	//Право
	ПроверитьКлетку(Столбец, Строка + 1, КолВоСоседей, КартаИгры);
	
	//Низ
	ПроверитьКлетку(Столбец + 1, Строка, КолВоСоседей, КартаИгры);
	
	//НизЛево
	ПроверитьКлетку(Столбец + 1, Строка - 1, КолВоСоседей, КартаИгры);
	
	//НизПраво
	ПроверитьКлетку(Столбец + 1, Строка + 1, КолВоСоседей, КартаИгры);
	
	Возврат КолВоСоседей;
КонецФункции 

&НаКлиенте
Процедура ПроверитьКлетку(Столбец, Строка, КолВоСоседей, КартаИгры)
	Верх = ЧсВерх(Столбец);
	Лево = ЧсПрав(Строка);
	
	Если КартаИгры[Верх][Лево] = 1 или КартаИгры[Верх][Лево] = 2 Тогда 
		КолВоСоседей = КолВоСоседей + 1;
	КонецЕсли;

КонецПроцедуры

//Закольцовываем карту по горизонтали
&НаКлиенте
Функция ЧсПрав(Число)
	Если Число < 0 Тогда 
		Возврат КолВоКлетокПоГоризонтали - 1;
	ИначеЕсли Число > КолВоКлетокПоГоризонтали - 1  Тогда
		Возврат 0;
	КонецЕсли;
	
	Возврат Число;
КонецФункции

//Закольцовываем карту по вертикали
&НаКлиенте
Функция ЧсВерх(Число)
	Если Число < 0 Тогда 
		Возврат КолВоКлетокПоВертикали - 1;
	ИначеЕсли Число > КолВоКлетокПоВертикали- 1 Тогда
		Возврат 0;
	КонецЕсли;
	
	Возврат Число;
КонецФункции


&НаКлиенте
Функция ВышлиЗаРамкиКарты(ТекКлетка)
	Если ТекКлетка.Лево < ЛеваяГраница 
		Или ТекКлетка.Верх < ВерхняяГраница 
		Или ТекКлетка.Право > ЛеваяГраница + КолВоКлетокПоГоризонтали - 1
		Или ТекКлетка.Низ > ВерхняяГраница + КолВоКлетокПоВертикали - 1
		Тогда
		
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
КонецФункции

&НаКлиенте
Процедура  ОчиститьКартуИгры()
	КартаИгры = новый Массив(КолВоКлетокПоВертикали, КолВоКлетокПоГоризонтали);
	
	Для Строка = 0 По КартаИгры.ВГраница() Цикл
		Для Столбец = 0 По КартаИгры[Строка].ВГраница() Цикл
			КартаИгры[Строка][Столбец] = 0;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры


#КонецОбласти

